<?php
if ($_SERVER["REQUEST_METHOD"] == "POST") {
    // Отримання даних з форми
    $name = $_POST['name'];
    $phone = '+80' . $_POST['phone']; // Додавання коду країни до номеру телефону

    // Адреса електронної пошти, на яку потрібно відправити повідомлення
    $to = "stanislav.gusiev@gmail.com";

    // Тема повідомлення
    $subject = "Запит на підбір авто";

    // Побудова тексту повідомлення
    $email_body = "Ім'я: $name\n" .
        "Телефон: $phone\n";

    // Відправлення email
    if (mail($to, $subject, $email_body)) {
        echo "Повідомлення відправлено успішно!";
    } else {
        echo "Виникла помилка при відправленні повідомлення.";
    }
}
